app/Http/Controllers/Procurement/NestedMaterialController.php

select * from `nested_materials`
select * from `units` where `units`.`id` in (2, 3, 5, 6, 8, 9, 10, 11, 12, 14, 17, 18)
---
    public function index()
    {
        $material_id = request()->material_id;
        if (request()->material_id) {

            $material_details = NestedMaterial::whereAncestorOrSelf($material_id)->get()->toTree();
            $material_depth = NestedMaterial::withDepth()->find(request()->material_id);

        } else {

            $materials = NestedMaterial::with('unit','account')->get();

select * from `nested_materials` where `nested_materials`.`parent_id` in (1, 123, 444, 456, 630, 816, 998, 1108, 1270, 2008, 2033, 2181, 2297, 2443, 2557, 2603, 2660, 2981, 2996, 3040, 4597, 4665)
---
    public function materialList()
    {
        $materials = NestedMaterial::with('descendants','ancestors')->withDepth()->having('depth', '=', 0)->whereNull('parent_id')
            ->paginate(1);