app/Http/Controllers/Procurement/UnitController.php

select * from `units` order by `created_at` desc
---
    public function index()
    {
        $units = Unit::latest()->get();