app/Http/Controllers/BillRegisterController.php

    public function index()
    {
        $bill_registers = BillRegister::latest('id')->get();
---
select * from `bill_registers` order by `id` desc