app/Http/Controllers/GeneralRequisitionController.php

select * from `requisitions` where `condition` is not null order by `created_at` desc
---
    public function index()
    {
        $requisitions = Requisition::whereNotNull('condition')->latest()->get();